#Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
n = input("введите число")
print("Hello,", n, end=('!'))