#Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.
a = int(input("введите число"))
b = int(input("введите число"))
c = int(input("введите число"))
print(a + b + c)