#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
# Каждое число записано в отдельной строке.
a = int(input("введите число"))
b = int(input("введите число"))
print((a * b) / 2)