#Даны два целых числа. Выведите значение наименьшего из них.
a = int(input("введите число"))
b = int(input("введите число"))
if b > a:
    print(a)
else:
    print(b)