#Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.
a = float(input("введите число"))
print(a - int(a))