#Дано натуральное число. Выведите его последнюю цифру.
a = int(input("введите число"))
print(a % 10)