#Дано положительное действительное число X. Выведите его дробную частьa
a = float(input("введите число"))
print(a - int(a))